{
  "title": "2020 Year End Review",
  "datePublished": "Jan 18, 2021 • 8 min read",
  "dateUpdated": "Feb 6, 2021 PM 5:29 CST",
  "covid": {
    "title": "COVID-19 Pandemic",
    "firstLine": "Minnesota in February is extremely cold. On the streets, the snow that has fallen all night is piled up to the knees, and some people wear <1>masks</1> to protect their faces from the cold wind. As usual, I went to school to take classes in the classroom, and after that, I went to the next class, talking with my friends. After finishing all of the classes, we had a dinner and went to the library to study together. I was having <1>ordinary</1> days without anything special.",
    "lines": "The first week of March was spring break. The day before the vacation started, I spent time with friends. And... that was the last time we saw each other in person. Spring break was extended due to the sudden outbreak of COVID-19 cases, and all of the following classes were replaced online.\nTo be honest, I was excited about the fact that I did not have to go to school. Within a month or less, however, my mind changed. I missed going to school and my friends.\nA noisy classroom filled with students. Small talk with friends before class starts. Professor’s witty comments during class. Those were times when we sat around a table and discussed a group project together; times when we went to the professor’s office hours and asked questions and discussed it together; times when I could say hello to a friend I met on the street by chance, go home and eat together.\nI have never thought I would miss going to school. I wished things would have gotten better so that I could have gone back to school in Fall 2020. Unfortunately, it did not work. With this COVID-19, I clearly felt how precious the naturalness of everyday life is. I want to see people’s faces, I want to shake hands, I want to hug them. I really miss my normal daily life."
  },
  "internship": {
    "title": "Summer Internship",
    "lines": "Lots of companies had canceled or delayed their scheduled internships due to the impact of COVID-19. There were actually some friends of mine whose jobs got canceled, not only interns but also full-time jobs. I was worried that it would happen to me, but fortunately, I was able to start my internship as scheduled. Although it was entirely working from home throughout the internship period, it was a phenomenal experience. More information about the internship experience can be found <1>here</1>."
  },
  "blackLivesMatter": {
    "title": "Black Lives Matter Protest",
    "lines": "Around the end of May in the evening when the wind was clear and sunny, I was watching the news while eating dinner after work. \"In Minneapolis, Minnesota, George Floyd, a black man, was killed by a white officer after being pinned down.\" Along with the reporter’s words, there was also a video of Floyd dying, a police officer’s knee on his neck. The place where the incident took place was about 10 minutes away from my apartment. It was even more shocking that an incident like this occurred so close to me.\nIn the United States, racism is (very unfortunately) frequent. I thought of this incident as one of the many cases. As an Asian woman who had no experience with racial discrimination (fortunately, till now), I thought that this would all go away within a few days. However, this incident led to the spread of protests against racial discrimination across the U.S., starting in Minneapolis. A lot of people went out to the streets and shouted for justice, and the government referred to them as thugs.\nBack then, I did not know enough about American society. So all I could do was educate myself. I thought I was not able to know how much discrimination they faced and how much sadness they had received unless I go through their lives. I researched for the media, what was actually happening, the historical background of the U.S., and social characteristics, etc. I thought that in order to speak up with the right voice, I needed to get it right before I did anything.",
    "learning": "There were so many things that I learned from this incident, and one thing is clear: <1>learning is a never-ending journey.</1> The more I learned, the more the case looked different. I realized thoroughly how much the amount of learning changes the world. How each individual thinks and acts has a significant influence on society. The individuals create a culture, and those cultures can solve or deepen social issues such as racial discrimination. I will learn more because I, or we, make our history.",
    "confucius": "I would like to close my thoughts on this case with a paragraph from a book called <1>Analects of Confucius</1> by Confucius.",
    "close": "\"<1>If there truly was justice in the world, people would understand and follow any rule or duty. There would be no voices of criticism, yet criticism can be heard. In other words, the voices of criticism from the people are no different to a warning to the world that justice no longer prevails.</1>\" (235)"
  },
  "vehicle": {
    "title": "Vehicle Damage and Theft",
    "lines": "Around mid-August, I had nothing to eat at home and was about to go get some food. When I tried to get in my car, it was weird. I double-checked the car again to see if it is mine or not. And yes, that was mine. The front passenger window was severely damaged. A thief smashed the window and took all of my items in the car. At the time, it was pretty shocking and embarrassing, so much so that I was speechless. I could not believe that this happened in my apartment’s private garage, which requires a key to enter. I reported it to the police and even looked for the criminal’s face on our security camera, but we could not capture him.\nI was trying to stay positive and I realized that I learned something from this incident: car insurance does not cover everything; the insurance process takes forever; the fact that the police are not really helpful(^^); never put anything in the car, and fortunately I was not hurt. This is a signal to me that I should be grateful and more careful in the future and I will do so."
  },
  "regulations": {
    "title": "New Regulations for International Students",
    "firstLine": "As the Fall 2020 semester approached, schools had to decide on class format, whether it is in-person, online, or both. Most schools preferred to go with online classes due to COVID-19 pandemic. The University of Minnesota was one of them, and all of the classes I registered for were confirmed as online. In the meantime, with about a month left until starting the Fall semester, the <1>U.S. Immigration and Customs Enforcement</1>, known as ICE, issued a new executive order: international students are required to attend in-person classes or leave the country. More specific orders are as follows:",
    "order1": "Active students currently in the U.S. enrolled in fully online classes must leave the states within 60 days.",
    "order2": "Students planning to continue staying in the U.S. should transfer to a school with in-person instruction to remain in lawful status.",
    "order3": "If not, they may face immigration consequences including the initiation of removal proceedings.",
    "secLine": "There are several reasons why the ICE makes this order. According to <1>ABC News</1>, President Trump repeatedly insisted schools 'must open' in Fall and it is tied to his broader push for the country to resume normal economic functions. According to <1>NPR News</1>, international students contributed $41 billion and supported 458,290 jobs during the 2018-2019 academic year. International students were being targeted in order to force schools to open because losing them is a huge blow to university budgets.",
    "lines": "As an international student, the last academic year just before graduation is extremely important. When we obtain a degree from the U.S. institution, we are given a chance called OPT(Optional Practical Training: A program that allows international students to work legally in the U.S. for 1 year after graduation. STEM students can apply for up to 3 years.). We normally go through a process of getting an H1B(work visa) and Green Card(permanent residency) starting with OPT. In other words, OPT is a tremendous opportunity and a privilege for international students to start their dreams in the U.S. after graduation. To apply for OPT, there is a requirement that we must stay in the U.S. while taking the last two semesters. That being said, if we leave the states on the executive order, all the opportunities are gone. I nearly had a mental breakdown. I would have had to leave the country and sacrifice my studies and the OPT opportunity.\nFortunately, the results did not go as intended. More than 200 schools including the University of Minnesota back lawsuit against Trump administration with a statement that they are stubbornly opposed to the executive order. 'We believe that the ICE order is bad public policy, and we believe that it is illegal' Harvard President Larry Bacow said in the statement. In addition, more than a dozen top American technology companies, including Google, Facebook, Microsoft, and Twitter joined the lawsuit filed by Harvard University. And a week later, ICE canceled the order.\nLiving in a foreign country is not easy. Sometimes I try to be wise when things like this happen, but it is true that initially they come as a shock. While living in the U.S., there are many restrictions, but I am becoming used to them. Similar situations will come to me, and next time I will have a strengthened mindset."
  },
  "graduation": {
    "title": "Graduation",
    "lines": "The biggest accomplishment for 2020 was graduation. I have been wanting this for so long, but I felt the futility when a diploma has been delivered. However, it is obviously a pleasure that I made something.\nIt reminds me of the day when I arrived at the states for the first time to study abroad. Living with an unfamiliar language and culture was not easy. There were so many things that I needed to care about other than school work, and I had to figure it out by myself. I had to deal with almost all of my emotions alone - happiness, sadness, sickness, nostalgia, and loneliness. In the process, however, I was able to boost a self-reliance to get through any challenges of my life on the back of my own resourcefulness, and a self-esteem that I acknowledge and love myself. I believe these life lessons are more important than academic results.\nThe four years of my study abroad story is officially done in December 2020 which I will never forget. I am so proud of myself that I can say I have done it. Now, no one knows where the amazing journey of my life will take me next. But I certainly know one thing. All of my best efforts will surely bring a great future. Whatever it is, I am ready for a new adventure."
  },
  "conclusion": {
    "title": "Conclusion",
    "lines": "2020 was cold, but precious. Through many incidents and events, I have learned and grown. Nothing happens without a reason, whether it is good or bad, and I am responsible for all the consequences. No matter what, I will move forward with a strong mindset for my next step in the future. Good riddance 2020!"
  }
}
