{
  "title": "SmartThings 여름 인턴십 후기",
  "datePublished": "2020년 9월 24일",
  "minRead": "• 6분 읽기",
  "dateUpdated": "2020년 9월 25일 오후 9:52 CST",
  "projectOverview": "프로젝트 개요",
  "sub": "인턴 기간 동안 진행했던 종합 모니터 시스템은 프로덕션 환경에서 발생할 수 있는 모든 문제에 대해 카나리아 역할을 한다. 이것은 API 호출에서 시작해 이벤트 전달로 끝나는 프로세스 시간을 측정해 기록한다.",
  "projectDate": "기간: 2020년 5월 18일 - 8월 21일\n팀: IoT Execution\n프로젝트: 종합 모니터 시스템 (Woof)",
  "timeline": {
    "title": "타임라인",
    "week1": {
      "title": "1-2주 차",
      "lines": "Java와 Spring Boot 상기시키며 공부하기\n프로젝트의 전반적인 상황 이해하기"
    },
    "week3": {
      "title": "3주 차",
      "lines": "본격적인 프로젝트의 첫 단계 시작\nConfig data를 읽고 HTTP를 활용해 goalie로 이벤트 보내기"
    },
    "week4": {
      "title": "4-5주 차",
      "lines": "REST API와 goalie를 사용하기 위한 mock 생성\nAWS Kinesis Java SDK를 활용해 로컬 Kinesis mock으로 이벤트 보내기"
    },
    "week6": {
      "title": "6-7주 차",
      "lines": "Records를 Kinesis로 보내는 작업 마무리\nConsumer part 시작"
    },
    "week8": {
      "title": "8-9주 차",
      "lines": "Woof, Goalie, 그리고 Kinesis에 걸친 모든 Producer와 Consumer 부분 마무리\n종합 모니터링 시스템의 기능 구현 - 시간 측정\nKinesis consuming 부분에서 race condition 문제 발생\nStateService와 Hasp map을 이용해 위의 문제를 해결"
    },
    "week10": {
      "title": "10주 차",
      "lines": "시간 측정에 관한 기능 추가 - 평균, 최대, 최소 시간\n프로그램 내에 발생하는 작은 버그들을 발견 및 해결"
    },
    "week11": {
      "title": "11-12주 차",
      "lines": "Spock와 Groovy를 사용해 시스템 품질 확인을 위한 테스팅 시작\nNullPointerException의 의미를 이해하기 위해 노력함\nUnit test와 Integration test에 관한 자료들을 공부"
    },
    "week13": {
      "title": "13주 차",
      "lines": "PMD report에서 발견된 오류들을 해결\n인턴 프레젠테이션 준비"
    },
    "week14": {
      "title": "14주 차",
      "lines": "인턴십 경험에 관한 문서 작성\n프로젝트의 전반적인 정보를 담은 README 작성과 마지막으로 프로그램 체크"
    }
  },
  "whatILearned": {
    "title": "배운 것들",
    "firstLine": "4개월의 인턴 기간 동안 배운 것은 정말 많다 - 특히 가장 메인으로 사용했던 Java와 Spring Boot.",
    "tools": "Java: 메소드, 클래스, 상속, 다형성, 예외처리, 등등.\nSpring Boot: Restful web service, Consuming, Producing, Yaml 파일 사용법, 로깅, Dependencies, Spring Annotation, 등등.\nIntellij: 디버깅, 실행, Gradle, 등등.\nGit: Merge, Branch 관리/수정, Commit, Fetch, 마스터와 로컬의 의미, 등등.\nAWS Kinesis: Mock Kinesis stream과 함께 실행한 멀티스레딩",
    "secLine": "테스팅의 중요성도 새로 알게 되었다. 프로그램이 완성됐다고 하여 끝난 것이 아니라, 내가 짠 코드들이 제대로 작동하는지 점검하는 과정도 꼭 필요하다는 것이다. 이전에 테스팅 했던 경험이 없어서 Groovy를 활용해 테스팅 코드를 짜는 게 쉽지만은 않았다. 처음이라 익숙해지는 데에 시간이 조금 걸렸지만, 더 열심히 공부하며 익혀나갔다. 테스팅을 하는 과정에서 원래 짜여있던 코드들을 다시 재정비하며 더 쉽고, 깔끔하게 정리할 수 있었다. 그와 동시에, 프로그램이 잘 돌아가는지 Method 하나하나에 집중하며 테스트를 거쳐나갔다. 결과적으로, 테스팅도 코딩만큼 중요한 과정임을 확실히 깨달았다.",
    "program": "Agile Scrum\nJira\nZoom\nSlack",
    "lastLine": "이번 인턴 과정이 더욱더 특별했던 것은 전면적인 재택근무의 영향이 크다. Agile Scrum의 일환으로 Stand up meeting을 포함한 모든 미팅과 대화는 Zoom과 Slack을 통해 이루어졌다. 덕분에 팀원들과 직접 만나지 않고도 효과적인 의사소통이 가능했다. 집에서 보내는 시간이 많아지면서 시간 관리가 중요했다. 인턴 초기 때 미리 개인 시간과 업무 시간을 확실히 분류한 덕에 혼란을 줄일 수 있었다. 언젠가 다시 재택근무 환경이 다가온다면, 그때는 (이번 경험 덕분에) 더 빠르게 익숙해질 수 있을 것이다."
  },
  "whatILiked": {
    "title": "좋아했던 것들",
    "lines": "이 경험을 통해 정말 훌륭한 분들을 많이 만났다. 매니저 Jeff와 일주일에 한 번씩 미팅을 가지며 프로젝트의 진행 방향에 대해 논의했다. 그가 프로젝트의 큰 그림을 그려주면, 멘토 Osberg는 매주 3회의 미팅을 통해 프로젝트의 세부 사항에 대해 지도해 주었다. 그들은 업무적인 것뿐만 아니라 개인적인 조언도 아끼지 않았다. 그들이 나에게 보여준 관심은 '내가 정말 이 팀의 중요한 일원이구나!'를 지속해서 느끼게 해주었다. 그들의 팀워크는 매우 효과적이었으며 인턴십을 성공적으로 끝마치는 데에 큰 도움이 되었다.\n나는 Visual learner로서, 새로운 것을 배우거나 표현할 때 시각화를 주로 하는 편이다. 가끔 일하면서 이해가 잘 되지 않는 개념들이 있었는데 그때마다 Jeff와 Osberg는 이미지를 이용해 설명해주었다. 덕분에 내가 처해있는 상황에 대해 이해가 잘 되었고, 오류를 해결해 다음 단계로 나아갈 수 있었다.\n나는 프로젝트를 이끌고 내가 원하는 방향으로 나아 갈 수 있는 자유를 얻었다. 프로젝트가 단계별로 진행됨에 따라, 다음 단계에는 어떤 것을 하면 좋을지 결정해야 하는 순간들이 있었다. 그럴 때마다 그들은 나에게 \"다음 단계에는 무엇을 해야 할까?\"라며 의견을 물었고, 그 과정에서 나는 프로젝트의 방향을 스스로 선택해야만 했다. 그들은 언제나 나의 의견을 존중해주었고, 내가 선택한 방향에 대해 지원해주었다. 이전에는 늘 정해진 길로만 갔다면, 이 기간동안은 오로지 나의 선택이 다음을 결정했다. 이것은 큰 책임감을 안겨주었으며, 프로젝트가 완성되었을 때에는 자부심과 뿌듯함도 함께 느낄 수 있었다.\n에자일 프로세스로 인해 프로젝트는 더 효율적이고 신속하게 진행되었다. 매일 갖는 Standup 미팅에서 우리는 각자 진행 중인 프로젝트에 관해 이야기했다. 어제 무엇을 했는지/오늘은 어떤 부분을 할 것인지/혹시 어려움이 있다면 무엇인지 등등을 이야기하며 의견을 나눴다. 또한, 2주에 한 번씩 이루어지는 Sprint 미팅에서 다음 목표를 정하고 각자 그에 맞는 티켓을 할당받았다. Agile Scrum팀에서 일하면서 나는 내가 해야 할 일들에 대해 자율 관리하며 스스로 업무 분량, 목표, 달성 방안을 결정했다. 그리고 내가 약속한 기한 안에 목표를 달성해야 한다는 책임도 함께 지어졌다.\n내가 생각하는 인턴의 가장 큰 장점/혜택은 어떤 질문을 해도 가능하다는 점과 새롭고 재능있는 사람들을 여러 분야에서 만나볼 수 있다는 것이다. 그리고 나는 그 혜택들을 적절히 사용했다. 궁금한 점이 생기면 바로 질문하며 호기심을 풀어나갔고, 견해를 넓히기 위해 최대한 많은 사람들에게 다가가 네트워크를 형성했다.\n재택근무 환경에서 팀원들과 직접 만나 이야기를 나누기는 쉽지 않았다. 그래서 나는 그들에게 1:1 개인 면담을 신청했고, 개인적으로 궁금했던 질문들을 하며 소통했다 - 학업적 배경, 경력, 인간관계를 다루는 법, 훌륭한 개발자가 되는 법, 의사소통 방법, 일과 삶의 균형, 목표 설정, 등등. 팀원들뿐만 아니라 호기심이 생겨 더 배우고 싶은 분들에게는 따로 Slack 메시지를 보내 면담을 요청했고, 모두 흔쾌히 응해주셨다 - IOS 앱 개발팀 매니저, 프론트 앤드팀 매니저, 책임 개발자님. 내가 준비한 질문들 외에도 좋은 말씀들을 많이 해 주셔서 정말 감사한 시간이었다. 덕분에 팀원들과 더 가까워지는 계기가 되었고, 내 견해가 한층 더 넓어진 느낌을 받았다."
  },
  "whatICouldImprove": {
    "title": "앞으로 개선 해야할 점",
    "lines": "프로그래밍은 추측과 확인의 반복이다. 계속해서 고민하고 이해하려고 노력할 것. 시스템에 문제가 발생 했을 경우엔, 오류 메시지가 전하는 내용을 추론하고 분석할 것. 설상 오류가 풀리지 않더라도, 스스로 고민하고 계속해서 시도하는 과정에서 분명 배움이 있을 것.\n문제에 접근 할때 비판적 사고를 연습하고 나만의 아이디어를 생각해내는 것을 두려워하지 말 것. 그것들은 좋은 아이디어일 수도 있고, 아닐 수도 있다. 하지만, 그 생각들을 밖으로 공개함으로써 논리적인 이유를 갖게 된다. 또한, 팀원들과 공유하는 과정에서 그 아이디어들이 실행에 옮겨질 수도 있고, 이전에 생각하지 못한 것에 대해 배울 수 있는 기회를 얻게 된다.",
    "lastLine": "항상 겸손하되, 열정적으로 공부할 것. 이 분야는 새로운 것들이 계속해서 업데이트 되는 곳이다. 그에 맞게 배움의 자세를 항상 취하고 있을 것. 배울수록 더 겸손 해야 할 것. 모든 일에는 열정을 감추지 말 것."
  },
  "conclusion": {
    "title": "끝맺음",
    "lines": "SmartThings에서 일했던 4개월의 시간은 잊을 수 없는 소중한 경험이 되었다. 나는 소프트웨어 엔지니어링 프로세스, 빠르게 움직이는 스타트업의 운영 방식, 좋은 코드 설계 및 표준에 대해 많은 것을 배웠다. 발전과 혁신에 전념하고 서로를 진정으로 돌보는 회사를 경험할 수 있어서 매우 기쁘게 생각한다. 이 모든 것은 나의 미래 커리어에 큰 도움이 될 것이라 확신한다. 나는 이 기회를 통해 엄청난 영감과 행복을 경험했으며 나와 함께해 준 팀원들에게 다시 한번 감사의 인사를 전하고 싶다. 전반적으로, 나는 SmartThings에서 Smart한 사람들과 함께 인턴십 프로그램을 성공적으로 마칠 수 있어 진심으로 기쁘게 생각한다.",
    "github": "<1>이 프로젝트의 Github 확인을 원하시는 분은 해당 링크를 클릭해 주세요.</1>"
  }
}
